---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarElemHookEndType
source: html/0e0fd0e1-aea2-6bdd-4d0b-d3337c7af44d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarElemHookEndType Property

"Hook At End"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarElemHookEndType { get; }
```